models/deepseek-v2-lite/benchmark_results/p50_sweep_20260313_055043/warmup.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x792cfaf18c20>, seed=42, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=7870, random_output_len=252, random_range_ratio=0.0, random_prefix_len=6000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p50_sweep_20260313_055043', result_filename='warmup_discard.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-a412399e-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-13 05:51:04 [datasets.py:611] Sampling input_len from [7869, 7869] and output_len from [252, 252]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [01:36<00:00,  1.04it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  96.43     
Total input tokens:                      1386900   
Total generated tokens:                  25200     
Request throughput (req/s):              1.04      
Output token throughput (tok/s):         261.33    
Peak output token throughput (tok/s):    338.00    
Peak concurrent requests:                92.00     
Total token throughput (tok/s):          14643.83  
---------------Time to First Token----------------
Mean TTFT (ms):                          33876.02  
Median TTFT (ms):                        34356.28  
P50 TTFT (ms):                           34356.28  
P90 TTFT (ms):                           59635.86  
P95 TTFT (ms):                           62800.11  
P99 TTFT (ms):                           65785.29  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          42.38     
Median TPOT (ms):                        42.59     
P50 TPOT (ms):                           42.59     
P90 TPOT (ms):                           43.96     
P95 TPOT (ms):                           44.04     
P99 TPOT (ms):                           44.12     
---------------Inter-token Latency----------------
Mean ITL (ms):                           42.38     
Median ITL (ms):                         37.58     
P50 ITL (ms):                            37.58     
P90 ITL (ms):                            41.34     
P95 ITL (ms):                            57.05     
P99 ITL (ms):                            151.01    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          44514.40  
Median E2EL (ms):                        45379.19  
P50 E2EL (ms):                           45379.19  
P90 E2EL (ms):                           70167.22  
P95 E2EL (ms):                           73204.35  
P99 E2EL (ms):                           75659.58  
==================================================